export default function AboutPage() {
  return <section>
    <h1>Про застосунок</h1>
    <p>
      Застосунок пошуку фільмів — це інтуїтивна платформа, створена для тих, хто хоче швидко знаходити цікаве кіно без зайвих зусиль. Він дозволяє користувачам вводити назву фільму, серіалу або ключові слова, після чого миттєво показує релевантні результати з бази даних TMDB (The Movie Database).
      Інтерфейс побудований на основі React і Bootstrap, що забезпечує адаптивність, швидкість та зручність користування як на десктопах, так і на мобільних пристроях. Кожен результат представлений у вигляді картки з постером, назвою, рейтингом, коротким описом і датою релізу. Користувач може переглянути детальну інформацію про фільм, включно з жанрами, виробниками, трейлерами та акторським складом.
      Особливу увагу приділено пагінації: якщо результатів багато, вони розбиті на сторінки з можливістю швидкого переходу між ними. Це дозволяє не перевантажувати інтерфейс і зберігати фокус на контенті.
      У майбутньому планується додати функції збереження улюблених фільмів, рекомендацій на основі переглядів та інтеграцію з стрімінговими платформами, а також застосунок буде підтримувати локалізацію, тому користувачі зможуть переглядати інформацію українською мовою.
      Це не просто пошук — це персональний гід у світі кіно!
    </p>
  </section>

}
